se='''
1. 견물생심(見物生心) : 실물을 보면 욕심이 생김.
2. 약육강식(弱肉强食) : 약한 자는 강한 자에게 먹힘.
3. 불문곡직(不問曲直) : 옳고 그른 것을 묻지도 아니하고 함부로 마구함.
4. 견강부회(牽强附會) : 이치에 맞지 아니한 말을 끌어 대어 자기에게 유리하게 함
5. 안빈낙도(安貧樂道) : 가난한 생활을 하면서도 편안한 마음으로 분수를 지키며 지냄
6. 괄목상대(刮目相對) : 눈을 비비고 상대방을 본다는 뜻. 남의 학식이나 재주가 놀랄 만큼 갑자기 드러난 것을 일컫는 말.
7. 사고무친(四顧無親) :사방을 둘러보아도 친한 사람이 없음. 곧 의지할 사람이 없음.
8. 아비규환(阿鼻叫喚) : 불교에서 말하는 팔대 지옥에서와 같은 고통을 견디기 어려워 구원을 청하여 울부짖는 것을 말함.
9. 경전하사(鯨戰蝦死) : 고래 싸움에 새우 등 터진다는 뜻으로, 강한 자들끼리의 싸움에 약한 자가끼어 아무 관계없이 피해를 입는다는 말.
10. 교왕과직(矯枉過直) : 소뿔을 바루다가 곧음에서 지나친다는 뜻으로, 잘못을 바로 잡으려다가 오히려 더 나쁘게 됨의 비유.
11. 교각살우(矯角殺牛) : 소의 뿔을 바로잡으려다가 소를 죽인다는 뜻으로, 잘못된 점을 고치려다가 그 방법이 지나쳐 오히려 일을 그르침의 비유.
12. 과유불급(過猶不及) : 지나친 것이나 모자란 것이나 다 같이 좋지 않음.
13. 침소봉대(針小棒大) : 작은 일을 크게 불리어 말함.
14. 호사다마(好事多魔) : 좋은 일에는 흔히 장애물이 들기 쉬움
15. 등고자비(登高自卑) : 높은 곳도 낮은 데서부터. 모든 일은 차례를 밟아서 해야 함.
16. 사필귀정(事必歸正) : 무슨 일이나 결국 옳은 이치대로 돌아감
17. 타산지석(他山之石) : 다른 산의 돌 자체로는쓸모가 없으나 옥을 갈면 다른 돌에 간 것보다옥이 빛난다는 사실에서 하찮은 남의 언행일지라도 자신을 수양하는 데에 도움이 된다는 말.
18. 고장난명(孤掌難鳴) : 한쪽 손뼉으로는 울리지 못한다는 뜻. 혼자서는 일을 이루기가 어려움. 맞서는 이가 없으면 싸움이 되지 아니함. 독장난명(獨掌難鳴)
19. 지록위마(指鹿爲馬) : 사슴을 가리켜 말이라 이른다는 뜻, 윗사람을 농락하여 권세를 마음대로 휘두르는 짓의 비유. 모순된 것을 끝까지 우겨 남을 속이려는 짓.
20. 노심초사(勞心焦思) : 마음으로 애를 써 속을 태움.
21. 금상첨화(錦上添花) : 비단 위에 꽃을 놓는다는 뜻으로, 좋은 일이 겹침의 비유 ↔ 설상가상(雪上加霜)
22. 다다익선(多多益善) : 많을수록 더욱 좋음.
23. 와신상담(臥薪嘗膽) : 불편한 섶에서 자고, 쓴 쓸개를 맛본다는 뜻. 마음 먹은 일을 이루기 위하여 온갖 괴로움을 무릅씀을 이르는 말.
24. 절차탁마(切磋琢磨) : 옥·돌·뼈·뿔 등을 갈고 닦아서 빛을 낸다는 뜻으로, 학문·도덕·기예 등을 열심히 닦음을 말함.
25. 주마가편(走馬加鞭) : 달리는 말에 채찍질을 계속함. 자신의 위치에 만족하지 않고 계속 노력함.
26. 삼고초려(三顧草廬) : 중국 촉한의 임금 유비가 제갈양의 초옥을 세 번이나 방문이여 마침내 군사(軍師)로 삼은 고사에서, 인재를 맞아 들이기 위해서 온갖 노력을 다함을 이르는 말.
27. 고식지계(姑息之計) : 당장 편한 것만을 택하는 꾀나 방법. 고식책. '고식(姑息)'은 일시적인 안정의 이미
28. 명약관화(明若觀火) : 불을 보듯이 환함.
29. 본말전도(本末顚倒) : 일의 원줄기를 잊고 사소한 부분에만 사로잡힘.
30. 적반하장(賊反荷杖) : 도둑이 되려 매를 든다는 뜻으로, 잘못한 자가 도리어 잘한 사람을 나무라는 경우를 이르는 말.
31. 후안무치(厚顔無恥) : 뻔뻔스러워 부끄러워할 줄을 모름.
32. 방약무인(傍若無人) : 곁에 사람이 없는 것 같다는 뜻. 거리낌 없이 함부로 행동함.
33. 화사첨족(畵蛇添足) : 뱀을 다 그리고 다리를덧붙인다는 뜻으로 쓸데없는 것을 덧붙여 하다가 도리어 실패함을 비유.
34. 일취월장(日就月將) : 날로 달로 자라거나 발전함.
35. 장삼이사(張三李四) : 장씨의 집 셋째 아들과 이씨의 넷째 아들이란 뜻으로, 이름이나 신분이 특별하지 아니한 평범한 사람들을 일컬음.
36. 새옹지마(塞翁之馬) : 국경에 사는 늙은이[새옹:人名]와 그의 말[馬]과 관련된 고사에서, 인생의 길흉화복은 변화가 많아 예측하기 어렵다는 말.
37. 고진감래(苦盡甘來) : 쓴 것이 다하면 단 것이 온다는 뜻으로, 고생 뜻으로, 고생 끝에 즐거움이 옴의 비유.
38. 상전벽해(桑田碧海) : 뽕나무 밭이 푸른 바다가 된다는 뜻으로, 변덕스럽게 자꾸 고침을 일컬음.
39. 조령모개(朝令暮改) : 아침에 법령을 만들고 저녁에 그것을 고친다는 뜻으로, 법령을 자꾸이리저리 고쳐 갈피를 잡기가 어려움을 이르는 말.
40. 자수성가(自手成家) : 물려받은 재산이 없이 스스로의 힘으로 한 살림을 이룩함.
41. 아전인수(我田引水) : 자기 논에 물대기란 뜻으로, 무슨 일을 자기에게 이로운 대로만 함을이르는 말.
42. 주마간산(走馬看山) : 바빠서 자세히 보지 못하고 지나침.
43. 설상가상(雪上加霜) : 눈 위에 서리가 덮인다는 뜻으로, 불행한 일이 거듭하여 겹침의 비유.
44. 견원지간(犬猿之間) : 개와 원숭이의 사이. 대단히 사이가 나쁜 관계.
45. 오월동주(吳越同舟) : 사이가 나쁜 사람끼리 마주치어 같은 장소·입장에 놓이게 됨
46. 풍수지탄(風樹之嘆) : 효도를 다하지 못한 채어버이를 여윈 자식의 슬픔을 이르는 말.
47. 감탄고토(甘呑苦吐) : 달면 삼키고 쓰면 뱉는다는 뜻.
48. 곡학아세(曲學阿世) : 정도를 벗어난 학문으로 세상 사람들에게 아첨함.
49. 면종복배(面從腹背) : 앞에서는 순종하는 체하고 돌아서는 딴마음을 먹음.
50. 토사구팽(兎死狗烹) : 토끼 사냥을 마치면 사냥개를 삶는다는 뜻으로, 자기의 목적을 이루고 나서 신의를 저버림의 비유.
51. 삼순구식(三旬九食) : 한 달에 아홉 끼를 먹을 정도로 매우 빈궁한 생활.
52. 조족지혈(鳥足之血) : 새 발의 피라는 뜻으로, 물건의 적음을 나타내는 말.
53. 화중지병(畵中之餠) : 그림의 떡. 곧 실속 없는 말에 비유하는 말.
54. 권선징악(勸善懲惡) : 착한 일을 권장하고 약한 일을 징계함.
55. 입신양명(立身揚名) : 입신출세하여 세상에 이름을 드날림.
56. 고장난명(孤掌難鳴) : 손뼉도 마주 쳐야 소리가 난다.
57. 낭중지추(囊中之錐) : 주머니에 들어간 송곳.뛰어난 자질은 언제든지 드러난다는 의미.
58. 당구풍월(堂狗風月) : 서당개 삼년에 풍월을읊는다.
59. 순망치한(脣亡齒寒) : 입술이 없으면 이가 시리다.
60. 오비삼척(吾鼻三尺) : 내 코가 석자. 자기 사정이 급하여 남을 돌보아 줄 겨를이 없음.
61. 오비이락(烏飛梨落) : 까마귀 날자 배 떨어진다. 아무 관계도 없는 일인데 우연히 때가 같음으로 인하여 무슨 관계가 있는 것처럼 의심을 받게 되는 것.
62. 우이독경(牛耳讀經) : 쇠귀에 경읽기. 아무리 가르치고 일러 주어도 알아듣지 못함.
63. 이현령비현령(耳懸鈴鼻懸鈴) : 귀에 걸면 귀걸이. 코에 걸면 코걸이의 뜻으로, 정해 놓은 것이 아닌 둘러댈 탓. 두 쪽에 관련된 것.
64. 정저지와(井底之蛙) : 우물 안 개구리. 세상물정을 너무 모름.
65. 호가호위(狐假虎威) : 원님 덕에 나팔 분다. 다른 사람의 권세를 빌어서 위세를 부림.
66. 교언영색(巧言令色) : 교묘한 말과 아첨하는 얼굴빛.
67. 감언이설(甘言利說) : 남의 비위에 맞도록 꾸민 달콤한 말과 이로운 조건을 내세워 꾀는 말.
68. 절치부심(切齒腐心) : 몹시 분하여 이를 갈면서 속을 썩임
69. 유비무환(有備無患) : 미리 준비해 두면 근심이 될 것이 없음.
70. 동병상련(同病相憐) : 같은 병의 환자끼리 서로 가엾게 여김. 처지가 서로 비슷한 사람끼리동정함.
71. 견문발검(見蚊拔劍) : 모기를 보고 칼을 뺌. 조그만 일에도 성을 내는 소견 좁은 행동
72. 각주구검(刻舟求劍) : 움직이는 배 위에서 칼을 빠뜨리고는 그 뱃전에 금을 그어 칼을 찾으려한다는 뜻에서, 시세의 변천도 모르고 낡은 것만 고집하는 어리석음을 비유하는 말. 어리석고 미련하여 융통성이 없음.
73. 수주대토(守株待兎) : 나무그루를 지켜 토끼를 기다린다는 말로 어리석음의 비유.
74. 등하불명(燈下不明) : 등잔 밑이 어둡다. 가까이 있는 것을 모름.
75. 구상유취(口尙乳臭) : 입에서 아직 젖내가 난다는 뜻. 말이나 하는 짓이 아직 유취함.
76. 소탐대실(小貪大失) : 작은 이익에 욕심을 내어 큰 이익을 놓임.
77. 목불식정(目不識丁) : 낫 놓고 기역자도 모름. 아주 무식함. 일자무식.
78. 연목구어(緣木求魚) : 나무에 올라 물고기를 구한다는 뜻. 불가능한 일을 무리하게 하려 함을 비유하는 말.
79. 구밀복검(口蜜腹劍) : 입에는 꿀, 뱃속에는 칼이라는 뜻. 말은 정답게 하나 속으로는 해칠생각이 있음.
80. 양두구육(羊頭狗肉) : 양의 대가리를 내걸고 실제로는 개고기를 팖. 겉으로는 그럴 듯하게 내세우나 속은 변변하지 아니함.
81. 풍전등화(風前燈火) : 바람 앞에 놓인 등불이란 뜻으로, 사물이 매우 위태로운 처지에 놓여있음을 비유하는 말.
82. 각골난망(刻骨難忘) : 은덕을 입은 고마움이 마음 깊이 새겨져 잊지 않음.
83. 이심전심(以心傳心) : 마음과 마음으로 서로 뜻이 통함.
84. 인과응보(因果應報) : 선과 악에 따라 반드시 업보가 있는 일.
85. 결자해지(結者解之) : 맺은 사람이 풀어야 한다는 뜻으로, 자기가 저지른 일은 자기가 해결하여야 한다는 말.
86. 천석고황(泉石膏肓) : 자연을 즐기는 버릇이 불치의 병처럼 되었다는 뜻으로, 그윽한 산수의 자연을 몹시 사랑하는 것을 말함.
87. 어부지리(漁父之利) : 양자가 다투는 바람에 엉뚱한 제삼자가 이익을 보게 됨을 이르는 말.
88. 호연지기(浩然之氣) : 온 세상에 가득 찬 넓고 큰 원기. 공명정대하여 조금도 부끄러움이 없는 데서 나오는 도덕적인 용기. 사물에서 해방 되어 자유스럽고 유쾌한 마음.
89. 부화뇌동(附和雷同) : 줏대 없이 남의 의견에 따라 움직임. '부화'는 붙어서 화함,'뇌동'은 덩달아 찬성함의 의미. ~하는 어중이떠중이들.
90. 수수방관(袖手傍觀) : 팔짱을 끼고 보고만 있음.
91. 풍비박산(風飛雹散) : 사방으로 날아 흩어짐.
92. 유구무언(有口無言) : 입은 있으나 말이 없다는 뜻으로, 변명을 못함을 이름.
93. 어불성설(語不成說) : 조리가 맞지 아니하여 도무지 말이 되지 아니함.
94. 형설지공(螢雪之功) : 반딧불과 눈빛으로 책을 읽어서 이룬 공.
95. 가렴주구(苛斂誅求) : 세금을 가혹하게 거두어 들이고 청구하여, 백성들을 못 살게 들볶음.
96. 화룡점정(畵龍點睛) : 용을 다 그린 다음 마지막으로 눈동자를 그려 넣는다는 뜻으로, 사물의 가장 요긴한 곳 또는, 무슨 일을 함에 가장 요긴한 부분을 끝내어 완성시킴의 비유.
97. 언중유골(言中有骨) : 예사로운 말 속에 단단한 뼈 같은 속뜻이 있다는 말.
98. 수구초심(首邱初心) : 여우가 죽을 때에 머리를 저 살던 굴 쪽으로 향한다는 뜻으로, 고향을 그리워하는 마음을 이르는 말.
99. 근묵자흑(近墨者黑) : 먹을 가까이 하면 검어진다는 뜻. 좋지 못한 사람과 가까이 하면 악에 물들게 됨.
100. 반포지효(反哺之孝) : 까마귀 어미가 늙으면 새끼가 먹이를 물어다 먹이는 효성이라는 뜻으로, 자식이 커서 어버이의 은혜에 보답하는 효성을 이르는 말.
'''
se=se.split('\n')
se=[i for i in se if len(i.strip())!=0]

def l(string):
    import re
    BASE_CODE, CHOSUNG, JUNGSUNG = 44032, 588, 28
  # 초성 리스트. 0 ~ 18
    CHOSUNG_LIST = ['ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']
# 중성 리스트. 0 ~ 20
    JUNGSUNG_LIST = ['ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ', 'ㅖ', 'ㅗ', 'ㅘ', 'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ', 'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ']
# 종성 리스트. 0 ~ 27 + 1(1개 없음)
    JONGSUNG_LIST = [' ', 'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ', 'ㄷ', 'ㄹ', 'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ', 'ㄿ', 'ㅀ', 'ㅁ', 'ㅂ', 'ㅄ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']
  
    sp_list = list(string) # string make list
    result = []
    for keyword in sp_list:
    # 한글 여부 check 후 분리
      if re.match('.*[ㄱ-ㅎㅏ-ㅣ가-힣]+.*', keyword) is not None:
    # 초성
        char_code = ord(keyword) - BASE_CODE
        char1 = int(char_code / CHOSUNG)
        result.append(CHOSUNG_LIST[char1])
    
    return ("".join(result)) # 자소 분리 결과 출력
def get_se():
    lines=se  
    import random
    random_lno=random.randint(0,len(lines)-1)
    li=lines[random_lno].split()[1].split("(")[0]
    hint=lines[random_lno].split(":")[1]
    return (li,hint)
def start_game():
  # 초성게임 코드
    print("*** 초성게임 v0.1***")
    print("*아래의 초성에 해당하는 사자성어를 입력하세요")

    while True:
      se=get_se()
      ch=l(se[0])
      print('초성 : ',ch)
      print('힌트 : ',se[1])
      ans=input("사자성어를 입력 : ")
      if ans==se[0]:
        print('정답')
        break
      print('넌 바보')